{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Honours Bachelor of Science",
      "department": "Computer Science, Statistics and Mathematics",
      "duration": "2017-2022",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_HumzaAfzal",
  "highlighted_projects": [
    {
      "description": "Utilized pygame to make a tower defense game. Worked in a team of 6 people following an agile/scrum development cycle using Jira with daily standups. Players used currency which is earned through killing monsters and spent by placing towers to kill the monsters. Added hitboxes by implementing particle collision as well as movement detection.",
      "name": "Tower Defense Game"
    },
    {
      "description": "Designed a paint application using Java and JavaFX using the MVC design pattern. Collaborated in a team of 4 following an agile/scrum development cycle. Managed the user stories and assigned them to the other collaborators. Implemented different brushes, shapes, and colours as well as a save and load feature.",
      "git_url": null,
      "name": "Paint Program"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Linux cluster monitoring agent. Using a combination of bash and SQL scripts, it registers a computer onto a PostgreSQL database, tracks its usage data every minute using a cronjob, and stores it in the database. SQL queries were leveraged to ensure that every machine in the cluster was functioning as expected. The project used git for version control and docker for distribution. System administrators would find this application useful because it lets them see the usage data on different computers in the cluster to see if they would need to adjust the specifications on any of the machines.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: This project implements a command line application that utilizes the Twitter REST API in order to provide basic CRUD operations on tweets such as post, look up or delete. The application takes user input via the command line and converts it into a request which is sent to Twitter using their REST API. Twitter then returns the Tweet object that was either posted, looked up, or deleted and sends it back to the user. This project uses SpringBoot for dependency management and conforms to the MVC architecture. Maven was used for application dependencies and Docker was used to distribute it. The OAuth 1.0 libraries were used to send and receive HTTP requests and responses and the Jackson library was used to serialize java objects into JSON and vice versa.",
        "JDBC App: This application utilizes JDBC to access a PostgreSQL database to perform CRUD operations. The Postgres database was hosted on a Docker container that used the postgres:9.6-alpine image. Maven was used as a build manager to build all the dependencies needed.",
        "Grep App: This project is an implementation of the grep bash command in Java. It parses through all the files in a given root directory through the use of lambda functions and java streams and prints out lines based on a regex defined by the user. Docker was also used to create an image of the application and was uploaded to DockerHub in order for it to be distributed."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "This java project is a trading app that lets users register, make an account, and trade stocks using real-world market data provided through the IEX Cloud API. Currently, it is a proof of concept so no actual trading is being done. The data is saved to a PostgreSQL database using JDBC. This project follows the microservice architecture and the Springboot framework for dependency management. The project is packaged using docker. SwaggerUI was utilized for the UI on the web browser. The user sends an HTTP request using the REST API via SwaggerUI which gets processed in the controller layer, the controller layer sends the request to the service layer which makes sure the request conforms to business logic (e.g. a trader must have an account before depositing money). The request then gets sent to the data access layer which interacts with the database and makes the appropriate SQL statement to execute on the PostgreSQL instance.",
      "git_url": "/springboot",
      "name": "Springboot App"
    }
  ],
  "name": "Humza Afzal",
  "others": [
    {
      "bullets": [
        "Waterloo Math Competition Medal Winner x2",
        "Won a silver medal in the Peel Chess League"
      ],
      "title": "Awards"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked in a team of 9 in an agile/scrum work environment with daily stand-ups and a biweekly sprint cycle. Gained development experience working with Linux, Bash, Java, and SQL as well as project lifecycle management and deployment experience using Git, Maven, and Docker. Other experience gained includes SpringBoot, JDBC, and REST API through the implementation of various projects.",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Nando's",
      "description": "Excelled in a fast pace work environment that required high precision and attention to detail. Quickly grasped the skills in a third of the time that was expected. Worked well as part of a team of 2-4 people. The role requires teamwork and coordination among team members to synchronize the timing of a customer's order so it all goes out to them at once. The job was demanding especially during peak hours when I had to plan how I would finish the orders based on how long they will take and when they came up.",
      "duration": "2019",
      "title": "Line Cook"
    }
  ],
  "skills": {
    "competent": [
      "NoSQL",
      "R",
      "Maven",
      "REST API",
      "Docker"
    ],
    "familiar": [
      "C#",
      "HTML/CSS",
      "Unreal Engine/Unity",
      "Javascript",
      "Racket/Haskell",
      "SpringBoot",
      "Django",
      "C"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Python"
    ]
  },
  "summary": "I am a recent graduate with an HBSc in Computer Science and Statistics from the University of Toronto. I have been doing working at Jarvis where I was able to demonstrate various technical skills like SQL, Linux, Java, SpingBoot, docker, and git in an agile development environment. During my time working at Jarvis, I worked in a team to develop a Linux cluster monitoring agent where usage data was stored in a PostgreSQL database, made an implementation of the Linux grep command in Java, and developed an app that lets users post, delete, and find tweets on Twitter using their REST API. I love this field because this field forces you to continually learn and better your skills. I have a particular interest in Fintech because I love stocks and personal finance. I think my background in computer science and statistics would be a major boon in this field. I am a hardworking team player with an emphasis on continuous improvement. I am looking for a company that values the continuous improvement of its employees with opportunities to learn more from more experienced people."
}
